Repository: CitrusForks/Pixelaria
Catalog: Pixelaria/Views/ModelViews/AnimationSheetView.*.resx
Languages: pt_br

# btn_cancel.Text
source: Cancel
pt_br: Cancelar

# nud_yPadding.ToolTip
source: The horizontal spacing to apply between each frame on the sheet texture. The spacing will also be applied around the texture edges.
pt_br: O espaçamento vertical para aplicar entre cada quadro e as bordas.

# nud_xPadding.ToolTip
source: The horizontal spacing to apply between each frame on the sheet texture. The spacing will also be applied around the texture edges.
pt_br: O espaçamento horizontal para aplicar entre cada quadro e as bordas.

# cb_favorRatioOverArea.Text
source: Favor ratio over area
pt_br: Favorecer razão em vez de área

# cb_favorRatioOverArea.ToolTip
source: Whether to favor ratio over minimum area. Checking this will produce a more square-ish image. The output is also produced faster, but may be slightly bigger in pixel count.
pt_br: Quando selecionado, faz o algoritmo de empacotamento de folha favorecer a razão do tamanho em vez da área tota. Escolher esta opção criará folhas mais quadradas e irá acelerar o processo de empacotamento. Esta opção pode aumentar o tamanho da folha.

# cb_forcePowerOfTwoDimensions.Text
source: Force power of two dimensions
pt_br: Forçar dimensões com potência de 2

# cb_forcePowerOfTwoDimensions.ToolTip
source: Whether to round the dimensions to a power-of-two extension. Mark this option to produce textures that are compliant with devices that only accept power-of-two sized textures. Marking this option may produce larger textures in size.
pt_br: Marque esta opção para criar folhas de quadros com tamanhos na potência de 2 (2, 4, 8, 16, 32, 64...). Marque esta opção para gerar folhas que pode ser utilizadas em dispositivos que requerem texturas em potência de 2. Esta opção aumentará significativamente o tamanho da folha.

# cb_forceMinimumDimensions.Text
source: Force minimum dimensions
pt_br: Recortar espaço em branco

# cb_forceMinimumDimensions.ToolTip
source: Checking this option will pack textures tightier by removing the transparent edges around the frames.
pt_br: Escolher esta opção forçará o empacotador a cortar o espaço em branco que rodeia quadros. Escolher esta opção pode reduzir significativamente o tamanho da folha.

# cb_reuseIdenticalFrames.Text
source: Reuse area of identical frames
pt_br: Reusar área de quadros idênticos

# cb_reuseIdenticalFrames.ToolTip
source: Checking this option will force the program to check for frames with the same contents, and will remove duplicated frames. When that happens, only one copy of the frame will be visible on the sheet, and the reference to the frames on the .xml will be duplicated to point to the same frame boundings. Note that this will method skips frames of different sizes, even if their contents may match
pt_br: Escolher esta opção para remover quadros com conteúdo duplicado e produzir arquivos .xml que referenciam os quadros duplicados no mesmo trecho da imagem. Note que quadros com conteúdo igual porém tamanhos diferentes não serão contados. Esta opção poderá reduzir significativamente o tamanho da folha.

# cb_highPrecision.Text
source: Use high precision area matching
pt_br: Usar alta precisão de área

# cb_highPrecision.ToolTip
source: Whether to use higher precision when packing frames toghether. Checking this will force the program to try to calculate the minimum possible area with a higher precision. May save a few precious pixels in exchange of a much longer export time.
pt_br: Escolher esta opção irá forçar o empacotador a usar uma precisão maior na hora de empacotar os quadros na folha. Escolher esta opção torna o processo mais lento, porém pode resultar em folhas menores. Ao usar em conjunto com a opção 'Favorecer razão em vez de tamanho', folhas mais quadradas podem ser geradas.

# cb_allowUordering.Text
source: Sort frames by size
pt_br: Ordenar quadros por tamanho

# cb_allowUordering.ToolTip
source: Whether to sort frames by size on the export sheet. The frames will be laid from larger dimensions to smaller. Checking this option will in almost all cases improve packing efficiency.
pt_br: Escolher esta opção ordenará os quadros na folha por ordem de tamanho, do maior para o menor. Esta opção quase sempre resulta em empacotamentos mais eficientes.

# cb_useUniformGrid.Text
source: Use uniform grid
pt_br: Usar grade uniforme

# cb_useUniformGrid.ToolTip
source: Whether to place the frames in a uniform grid that is sized according to the smallest dimensions capable of fitting all the frames. Setting this option overrides the 'Force minimum dimensions' option.
pt_br: Escolher esta opção força os quadros a serem dispostos numa grade uniforme cujo tamanho é o mesmo do maior quadro da folha. Escolher esta opção desativa a opção 'Recortar espaço em branco'.

# cb_exportXml.Text
source: Export Xml
pt_br: Exportar Xml

# cb_exportXml.ToolTip
source: Whether to export an .xml file along with the texture files. The .xml will hold the list of all the animations and their respective frames as well as the frame bounds. The .xml will be referenced on a main bundle .xml once exported.
pt_br: Escolha esta opção para gerar um arquivo .xml que contém informações sobre a folha de animação durante a exportação do pacote. O arquivo .xml irá ser referenciado pelo xml principal do pacote.

# cb_padFramesOnXml.Text
source: Pad frame bounds on XML
pt_br: Empurrar limites dos quadros no XML

# cb_padFramesOnXml.ToolTip
source: Whether to pad the frame boundaries on the .xml as well. Padding the frames on the .xml means the coordinates for the frame boundaries on the sheet to be inflated by the X and Y padding that are set bellow. This may remove texture warping artifacts produced by clipped textures on some drawing engines.
pt_br: Escolha esta opção para acomodar informações sobre espaçamento no XML também. Empurrar os quadros no XML significa inflar as coordenadas X e Y dos quadros pelo valor a baixo. Isso pode resolver alguns problemas de distorção nos quadros em algumas engines.

# label4.Text
source: Y padding:
pt_br: Espaçamento Y:

# label3.Text
source: X padding:
pt_br: Espaçamento X::

# btn_generatePreview.Text
source: Generate Preview
pt_br: Gerar Prévia

# groupBox2.Text
source: Export Settings
pt_br: Configurações de Exportação

# label1.Text
source: Name:
pt_br: Nome:

# groupBox1.Text
source: Animation Sheet Information
pt_br: Informações da Folha

# lbl_sheetPreview.Text
source: Sheet Preview:
pt_br: Prévia da Folha:

# label5.Text
source: Frame Count:
pt_br: Nº de Quadros:

# label2.Text
source: Animations:
pt_br: Animações:

# gb_sheetInfo.Text
source: Sheet Info
pt_br: Informações da Folha

# label11.Text
source: Memory usage:
pt_br: Memória usada:

# lbl_reusedFrames.ToolTip
source: The number of frames that got their areas reused on the sheet.
pt_br: O número de quadros que foram reusados na folha.

# lbl_framesOnSheet.ToolTip
source: The total ammount of frames visible on the sheet, not including reused frames.
pt_br: O número total de quadros visíveis na folha, excluindo os quadros reusados.

# label9.Text
source: Reused frames:
pt_br: Quadros reusados:

# label8.Text
source: Frames:
pt_br: Quadros:

# label7.Text
source: Pixel count:
pt_br: Nº de Píxels:

# label6.Text
source: Dimensions:
pt_br: Dimensões:

# gb_exportSummary.Text
source: Export Summary
pt_br: Sumário de Exportação

# cb_showFrameBounds.Text
source: Show individual frame bounds
pt_br: Mostrar espaços dos quadros

# btn_apply.Text
source: &Apply
pt_br: &Aplicar

# cb_showReuseCount.Text
source: Show use count
pt_br: Mostrar contagem de uso

# $this.Text
source: Animation Sheet Editor
pt_br: Editor de Folhas de Animação
